AIKASIR/app/Controllers/Kasir/KasirApi.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
AND `password` = '0192023a7bbd73250516f069df18b500'
 LIMIT 1
---
    public function login(): ResponseInterface
    {
        $data = $this->request->getJSON(true);
        $model = new UserModel();
        $user = $model->where('username', $data['username'])
                      ->where('password', md5($data['password'])) // sebaiknya gunakan hashing aman!
                      ->first();

SELECT *
FROM `products`
---
    public function products(): ResponseInterface
    {
        $model = new ProductModel();
        $products = $model->findAll();